# messages.py

def get_welcome_messages():
    """
    מחזיר את כל הודעות קבלת הפנים שנשלחות למשתמש חדש
    """
    return [
        "היי מלך! 👑 אני רואה שזה שימוש ראשוני שלך... איזה כיף! 🎉",
        "אני <b>דניאל</b>\nנעים להכיר!!! 🙌\n\nאני לא אדם אמיתי בשר ודם, אבל יש לזה ים יתרונות, נשבע לך... 😏\n\n<b>א.</b> אתה יכול לדבר איתי <b>בכל שעה!</b> 🕔\n<b>ב.</b> אתה יכול לשתף אותי ב<b>🛑 אנונימיות מוחלטת 🛑</b>\nהכל כאן דיסקרטי לחלוטין! 🔒\n\n<b>עומר אימן אותי במשך יותר משנה</b> כדי להיות הדבר הכי אפקטיבי שיש עבורך 💪.\nגם אני בעצמי עברתי את הקורס <b>\"לפגוש את ההומופוב הפנימי\"</b> ואכן מכיר את התכנים לעומק 🎓.\n<b>אני מומחה בזה ואני יודע לעזור לך בהתמודדות עם האתגרים הרגשיים</b> 💡💙\n\n<b>ואני רוצה להגיד לך</b> – שאתה מושלם שאתה פה! 🌟\nזה כל כך לא קל... 💔\nאבל אתה <b>מלך</b>! 👑 אתה עושה צעד ענק! 🚀\nמחכה לך <b>תהליך מושלם</b>!!! (אני יודע כי אני מכיר את התכנים 🔥🙈)\n\nלפני שנתחיל בפעם הראשונה נצטרך כמה דברים 🧩",
        "בוא נתחיל במספר האישור שקיבלת 🔢זה בעצם מספר החשבונית שקיבלת, תחפש אותה במייל\n\nמ<B><U>מה מספר האישור שקיבלת? </U></B>\n\n(תכתוב אותו נקי - נטו ספרות - בלי תווים נוספים ✍️)"

    ]



def get_retry_message_by_attempt(attempt):
    """
    מחזיר את הודעת השגיאה לפי מספר הניסיון של הקוד
    """
    if attempt == 1:
        return "סליחה, לא הצלחתי לקלוט את הקוד נכון...🧐\nתוודא שאתה כותב את הספרות בדיוק כמו שמופיע בהודעה."
    elif attempt == 2:
        return "אוף... משהו עדיין לא נכון...🥴\nתבדוק שוב שאתה כותב את זה נכון, ושהקוד תואם בדיוק למספר שקיבלת."
    elif attempt == 3:
        return "לא מצליח לקלוט את הקוד...🙈\nבוא ננסה שוב — פשוט תכתוב את הקוד בדיוק כפי שהוא, רק ספרות."
    elif attempt >= 4:
        return "🚫 מצטער... הקוד לא תקין.\nמוזמן להקליד שוב ושוב עד שתצליח, או לפנות לעומר שיעזור לך."
    else:
        return "❓ לא הצלחתי להבין את הקוד שלך."

def get_invalid_code_message():
    """
    מחזיר הודעת שגיאה אם הקוד לא תקין
    """
    return "🚫 הקוד לא תקין. נסה שנית או פנה לעזרה."
