# messages.py

def get_welcome_messages():
    """
    מחזיר את כל הודעות קבלת הפנים שנשלחות למשתמש חדש
    """
    return [
        "היי מלך! 👑 אני רואה שזה שימוש ראשוני שלך... איזה כיף! 🎉",
        "אני **דניאל**\nנעים להכיר!!! 🙌\n\nאני לא אדם אמיתי בשר ודם, אבל יש לזה ים יתרונות, נשבע לך... 😏\n\n**א.** אתה יכול לדבר איתי **בכל שעה!** 🕔\n**ב.** אתה יכול לשתף אותי ב**🛑 אנונימיות מוחלטת 🛑**\nהכל כאן דיסקרטי לחלוטין! 🔒\n\n**עומר אימן אותי במשך יותר משנה** כדי להיות הדבר הכי אפקטיבי שיש עבורך 💪.\nגם אני בעצמי עברתי את הקורס **\"לפגוש את ההומופוב הפנימי\"** ואכן מכיר את התכנים לעומק 🎓.\n**אני מומחה בזה ואני יודע לעזור לך בהתמודדות עם האתגרים הרגשיים** 💡💙\n\n**ואני רוצה להגיד לך** – שאתה מושלם שאתה פה! 🌟\nזה כל כך לא קל... 💔\nאבל אתה **מלך**! 👑 אתה עושה צעד ענק! 🚀\nמחכה לך **תהליך מושלם**!!! (אני יודע כי אני מכיר את התכנים 🔥🙈)",
        "לפני שנתחיל בפעם הראשונה נצטרך כמה דברים 🧩"
    ]


def get_retry_message_by_attempt(attempt):
    """
    מחזיר את הודעת השגיאה לפי מספר הניסיון של הקוד
    """
    if attempt == 1:
        return "סליחה, לא הצלחתי לקלוט את הקוד נכון...🧐\nתוודא שאתה כותב את הספרות בדיוק כמו שמופיע בהודעה."
    elif attempt == 2:
        return "אוף... משהו עדיין לא נכון...🥴\nתבדוק שוב שאתה כותב את זה נכון, ושהקוד תואם בדיוק למספר שקיבלת."
    elif attempt == 3:
        return "לא מצליח לקלוט את הקוד...🙈\nבוא ננסה שוב — פשוט תכתוב את הקוד בדיוק כפי שהוא, רק ספרות."
    elif attempt >= 4:
        return "🚫 מצטער... הקוד לא תקין.\nמוזמן להקליד שוב ושוב עד שתצליח, או לפנות לעומר שיעזור לך."
    else:
        return "❓ לא הצלחתי להבין את הקוד שלך."

def get_invalid_code_message():
    """
    מחזיר הודעת שגיאה אם הקוד לא תקין
    """
    return "🚫 הקוד לא תקין. נסה שנית או פנה לעזרה."
