# messages.py

def get_welcome_messages():
    """
    מחזיר את כל הודעות קבלת הפנים שנשלחות למשתמש חדש
    """
    return [
        "👑 <b>היי מלך!</b> אני רואה שזה <i>שימוש ראשון</i> שלך בצ'אט... איזה כיף! 🎉",
        "🙌 <b>אני דניאל – המלווה הרגשי הווירטואלי שלך!</b> נעים להכיר! 🤝\n\n🤖 <i>אני לא אדם אמיתי בשר ודם, אבל יש בזה ים יתרונות, נשבע לך... 😏</i>\n\n<b>א.</b> אתה יכול לדבר איתי <u><b>בכל שעה!</b></u> 🕔\n<b>ב.</b> אתה משתף אותי <b>🛑 באנונימיות מוחלטת 🛑</b> – הכל כאן דיסקרטי לחלוטין! 🔒\n\n💪 <b>עומר</b> אימן אותי במשך יותר משנה (!) כדי להיות הכי טוב שיש.\n🎓 גם אני בעצמי עברתי את הקורס <b>\"לפגוש את ההומופוב הפנימי\"</b> ואני מכיר את התכנים לעומק (ואל תשאל, אפילו עשיתי שיעורי בית 🤫)\n💡 <b>אני מומחה בזה ואני יודע לעזור לך בהתמודדות עם האתגרים הרגשיים</b> 💙\n\n🌟 <b>ואני רוצה להגיד לך</b> – שאתה מושלם שאתה פה! זה כל כך לא קל... 💔 אבל אתה <b>מלך</b>! 👑 אתה עושה צעד ענק! 🚀 מחכה לך <b>תהליך מושלם</b>!!! (אני יודע כי אני מכיר את התכנים 🔥🙈)\n\nלפני שנתחיל בפעם הראשונה נצטרך כמה דברים 🧩",
        "🔢 <b>בוא נתחיל עם מספר האישור שלך</b> – זה המספר שמופיע על החשבונית, תחפש אותו במייל שלך ✉️\n\n<u><b>מה מספר האישור שקיבלת?</b></u>\n\n<i>כתוב רק את המספר, בלי תווים נוספים ✍️</i>",

    ]



def get_retry_message_by_attempt(attempt):
    """
    מחזיר את הודעת השגיאה לפי מספר הניסיון של הקוד
    """
    if attempt == 1:
        return "סליחה, לא הצלחתי לקלוט את הקוד נכון...🧐\nתוודא שאתה כותב את הספרות בדיוק כמו שמופיע בהודעה."
    elif attempt == 2:
        return "אוף... משהו עדיין לא נכון...🥴\nתבדוק שוב שאתה כותב את זה נכון, ושהקוד תואם בדיוק למספר שקיבלת."
    elif attempt == 3:
        return "לא מצליח לקלוט את הקוד...🙈\nבוא ננסה שוב — פשוט תכתוב את הקוד בדיוק כפי שהוא, רק ספרות."
    elif attempt >= 4:
        return "🚫 מצטער... הקוד לא תקין.\nמוזמן להקליד שוב ושוב עד שתצליח, או לפנות לעומר שיעזור לך."
    else:
        return "❓ לא הצלחתי להבין את הקוד שלך."

def get_invalid_code_message():
    """
    מחזיר הודעת שגיאה אם הקוד לא תקין
    """
    return "🚫 הקוד לא תקין. נסה שנית או פנה לעזרה."
