# הודעות קבלת פנים למשתמשים חדשים
WELCOME_MESSAGES = [
    "היי מלך! 👑 אני רואה שזה שימוש ראשוני שלך...\nאיזה כיף! 🎉",
    "אתה תופתע לגלות איזה שימושי אני 😎\nאני יודע מה אתה חושב... בינה מלאכותית וזה...\nתן לי להפתיע אותך!! 🚀",
    "לפני שנתחיל בפעם הראשונה נצטרך כמה דברים 🧩"
]

# הודעות חזרה על הקוד
RETRY_CODE_MESSAGES = [
    "סליחה, לא הצלחתי לקלוט את הקוד נכון...🧐\nתוודא שאתה כותב את הספרות בדיוק כמו שמופיע בהודעה.",
    "אוף... משהו עדיין לא נכון...🥴\nתבדוק שוב שאתה כותב את זה נכון, ושהקוד תואם בדיוק למספר שקיבלת.",
    "לא מצליח לקלוט את הקוד...🙈\nבוא ננסה שוב — פשוט תכתוב את הקוד בדיוק כפי שהוא, רק ספרות."
]

# הודעה אם הקוד לא תקין אחרי מספר ניסיונות
INVALID_CODE_MESSAGE = "🚫 מצטער... הקוד לא תקין.\nמוזמן להקליד שוב ושוב עד שתצליח, או לפנות לעומר שיעזור לך."

# פונקציה לשלוח את כל הודעות קבלת הפנים
def get_welcome_messages():
    """ מחזיר את כל הודעות קבלת הפנים """
    return WELCOME_MESSAGES

# פונקציה לשלוח את הודעות החזרה על הקוד, תלוי בניסיון
def get_retry_message_by_attempt(attempt):
    """ מחזיר את ההודעה המתאימה לפי מספר הניסיון """
    if attempt < 1:
        return RETRY_CODE_MESSAGES[0]
    elif attempt == 1:
        return RETRY_CODE_MESSAGES[1]
    elif attempt >= 2:
        return RETRY_CODE_MESSAGES[2]

# פונקציה לשלוח את הודעת "קוד לא תקין" אחרי מספר ניסיונות
def get_invalid_code_message():
    """ מחזיר את הודעת הקוד לא תקין """
    return INVALID_CODE_MESSAGE
